app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "text", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Fri, 17 Oct 2014 23:12:54 UTC +00:00], ["text", "first post after postgres was configured"], ["title", "Postgres post"], ["updated_at", Fri, 17 Oct 2014 23:12:54 UTC +00:00]]
---
	def create
		@post = Post.new(params[:post].permit(:title, :text))

		if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."id" ASC LIMIT 1  [["id", 1]]
---
	def show
		@post = Post.find(params[:id])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "posts" SET "image" = ?, "updated_at" = ? WHERE "posts"."id" = 8  [["image", "Crysis.jpg"], ["updated_at", Thu, 31 Oct 2013 20:38:07 UTC +00:00]]
---
	def update
		@post = Post.find(params[:id])

	  if @post.update(params[:post].permit(:title, :text, :image))